Revit 2024 API
BuiltInFailures.DimensionFailures.SpotSlopeReferenceIsVertical Property
 The highlighted Spot Slope references an element that is vertical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SpotSlopeReferenceIsVertical { get; }
Visual Basic
Public Shared ReadOnly Property SpotSlopeReferenceIsVertical As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SpotSlopeReferenceIsVertical {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace